Org/rLandsat8_(2014-04-22_by_Terradue).org
+ Package: rLandsat8
+ Type: Package
+ Title: This package consumes Landsat 8
+ Version: ${parsedVersion.majorVersion}.${parsedVersion.minorVersion}.${parsedVersion.incrementalVersion}
+ Date: 2014-04-22
+ Author: Terradue
+ Description: More about what it does (maybe more than one line)
+ License: Apache License, Version 2.0
+ Depends:
+     raster
* dNBR.R
#+BEGIN_SRC R 
dNBR <- function(prefire, postfire, is.suncorrected = FALSE) {
  dnbr <- ToNBR(prefire, is.suncorrected) - ToNBR(postfire, is.suncorrected)
  return(dnbr)
}
#+END_SRC
* DownloadLandsat.R
#+BEGIN_SRC R 
DownloadLandsat <- function(url, output.name) {
  
  
  command.args <- paste0(-c cookies.txt -d 'username=, usgs.username, &password=, usgs.password,' https://earthexplorer.usgs.gov/login)
  
  
  
  ret <- system2(curl, command.args, stdout=TRUE, stderr=TRUE)
  
  command.args <- paste0(-b cookies.txt -L , url, -o , output.name)
  ret <- system2(curl, command.args, stdout=TRUE, stderr=TRUE)
  
  file.remove(cookies.txt)
  
  return(ret)
  
}
#+END_SRC
