html/rLandsat8_(2014-04-22_by_Terradue).html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>rLandsat8_(2014-04-22_by_Terradue)</title>
<!-- 2014-09-15 Mon 21:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="tian" />
</head>
<body>
<div id="content">
<h1 class="title">rLandsat8_(2014-04-22_by_Terradue)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. dNBR.R</a></li>
<li><a href="#sec-2">2. DownloadLandsat.R</a></li>
<li><a href="#sec-3">3. ReadLandsat8.R</a></li>
<li><a href="#sec-4">4. ToAtSatelliteBrightnessTemperature.R</a></li>
<li><a href="#sec-5">5. ToLSWI.R</a></li>
<li><a href="#sec-6">6. ToMNDWI.R</a></li>
<li><a href="#sec-7">7. ToNBR.R</a></li>
<li><a href="#sec-8">8. ToNBRClass.R</a></li>
<li><a href="#sec-9">9. ToNDVI.R</a></li>
<li><a href="#sec-10">10. ToTOARadiance.R</a></li>
<li><a href="#sec-11">11. ToTOAReflectance.R</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>Package: rLandsat8
</li>
<li>Type: Package
</li>
<li>Title: This package consumes Landsat 8
</li>
<li>Version: ${parsedVersion.majorVersion}.${parsedVersion.minorVersion}.${parsedVersion.incrementalVersion}
</li>
<li>Date: 2014-04-22
</li>
<li>Author: Terradue
</li>
<li>Description: More about what it does (maybe more than one line)
</li>
<li>License: Apache License, Version 2.0
</li>
<li>Depends:
</li>
<li>raster
</li>
</ul>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> dNBR.R</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">dNBR</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>prefire, postfire, is.suncorrected <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
  dnbr <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToNBR</span><span style="color: #20b2aa;">(</span>prefire, is.suncorrected<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">-</span> <span style="color: #ff6347;">ToNBR</span><span style="color: #20b2aa;">(</span>postfire, is.suncorrected<span style="color: #20b2aa;">)</span>
  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>dnbr<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> DownloadLandsat.R</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">DownloadLandsat</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>url, output.name<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>


  command.args <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #ff00ff;">-</span>c cookies.txt <span style="color: #ff00ff;">-</span>d <span style="color: #00ff00;">'username=, usgs.username, &amp;password=, usgs.password,'</span> https:<span style="color: #ff00ff;">//</span>earthexplorer.usgs.gov<span style="color: #ff00ff;">/</span>login<span style="color: #20b2aa;">)</span>



  ret <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">system</span><span style="color: #daa520;">2</span><span style="color: #20b2aa;">(</span>curl, command.args, stdout<span style="color: #ff00ff;">=</span><span style="color: #daa520;">TRUE</span>, stderr<span style="color: #ff00ff;">=</span><span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span>

  command.args <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #ff00ff;">-</span>b cookies.txt <span style="color: #ff00ff;">-</span>L , url, <span style="color: #ff00ff;">-</span>o , output.name<span style="color: #20b2aa;">)</span>
  ret <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">system</span><span style="color: #daa520;">2</span><span style="color: #20b2aa;">(</span>curl, command.args, stdout<span style="color: #ff00ff;">=</span><span style="color: #daa520;">TRUE</span>, stderr<span style="color: #ff00ff;">=</span><span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span>

  <span style="color: #ff6347;">file.remove</span><span style="color: #20b2aa;">(</span>cookies.txt<span style="color: #20b2aa;">)</span>

  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>ret<span style="color: #20b2aa;">)</span>

<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
