html/rLandsat8_(2014-04-22_by_Terradue).html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> ReadLandsat8.R</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">ReadLandsat8</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>product<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>  
  raster.files <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>aerosol<span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">1</span>,
    blue<span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">2</span>, 
    green<span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">3</span>,
    red<span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">4</span>,
    nir<span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">5</span>,
    swir<span style="color: #daa520;">1</span><span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">6</span>,
    swir<span style="color: #daa520;">2</span><span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">7</span>,
    panchromatic<span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">8</span>,
    cirrus<span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">9</span>,
    tirs<span style="color: #daa520;">1</span><span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">10</span>,
    tirs<span style="color: #daa520;">2</span><span style="color: #ff00ff;">=</span>file_name_band_<span style="color: #daa520;">11</span>
    <span style="color: #20b2aa;">)</span>

  meta.file <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>product, <span style="color: #ff00ff;">/</span>, product, _MTL.txt<span style="color: #20b2aa;">)</span>

  <span style="color: #00ffff;">if</span> <span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">file.exists</span><span style="color: #20b2aa;">(</span>meta.file<span style="color: #20b2aa;">))</span>
       <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>meta.file, file not found.<span style="color: #20b2aa;">))</span>

  textLines <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">readLines</span><span style="color: #20b2aa;">(</span>meta.file<span style="color: #20b2aa;">)</span>

  counts <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">count.fields</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">textConnection</span><span style="color: #20b2aa;">(</span>textLines<span style="color: #20b2aa;">)</span>, sep<span style="color: #ff00ff;">==</span><span style="color: #20b2aa;">)</span>

  met <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">read.table</span><span style="color: #20b2aa;">(</span>text<span style="color: #ff00ff;">=</span>textLines<span style="color: #20b2aa;">[</span>counts <span style="color: #ff00ff;">==</span> <span style="color: #daa520;">2</span><span style="color: #20b2aa;">]</span>, as.is<span style="color: #ff00ff;">=</span><span style="color: #daa520;">TRUE</span>, header<span style="color: #ff00ff;">=</span><span style="color: #daa520;">FALSE</span>, sep<span style="color: #ff00ff;">==</span>, strip.white<span style="color: #ff00ff;">=</span><span style="color: #daa520;">TRUE</span>, stringsAsFactors<span style="color: #ff00ff;">=</span><span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

  met <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">read.table</span><span style="color: #20b2aa;">(</span>text<span style="color: #ff00ff;">=</span>textLines<span style="color: #20b2aa;">[</span>counts <span style="color: #ff00ff;">==</span> <span style="color: #daa520;">2</span><span style="color: #20b2aa;">]</span>, as.is<span style="color: #ff00ff;">=</span><span style="color: #daa520;">TRUE</span>, header<span style="color: #ff00ff;">=</span><span style="color: #daa520;">FALSE</span>, sep<span style="color: #ff00ff;">==</span>, strip.white<span style="color: #ff00ff;">=</span><span style="color: #daa520;">TRUE</span>, stringsAsFactors<span style="color: #ff00ff;">=</span><span style="color: #daa520;">FALSE</span>, row.names <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">NULL</span>, col.names<span style="color: #ff00ff;">=</span><span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>name, value<span style="color: #20b2aa;">))</span>

  met <span style="color: #ff00ff;">&lt;-</span> met<span style="color: #20b2aa;">[</span>!met$name <span style="color: #ff00ff;">==</span> GROUP, <span style="color: #20b2aa;">]</span> 
  met <span style="color: #ff00ff;">&lt;-</span> met<span style="color: #20b2aa;">[</span>!met$name <span style="color: #ff00ff;">==</span> END_GROUP, <span style="color: #20b2aa;">]</span> 
  <span style="color: #ff6347;">rownames</span><span style="color: #20b2aa;">(</span>met<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">tolower</span><span style="color: #20b2aa;">(</span>met<span style="color: #20b2aa;">[</span>, name<span style="color: #20b2aa;">])</span>
  met<span style="color: #20b2aa;">[</span>, name<span style="color: #20b2aa;">]</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">NULL</span>

  met <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">as.list</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">as.data.frame</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">t</span><span style="color: #20b2aa;">(</span>met<span style="color: #20b2aa;">)</span>, stringsAsFactors<span style="color: #ff00ff;">=</span><span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">))</span>

  bands<span style="color: #ff00ff;">=</span><span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span>raster.files, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
    r <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">raster</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>product, <span style="color: #ff00ff;">/</span>, met<span style="color: #20b2aa;">[[</span>x<span style="color: #20b2aa;">]]))</span>
    r@title <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>raster.files<span style="color: #20b2aa;">)[</span><span style="color: #ff6347;">seq_along</span><span style="color: #20b2aa;">(</span>raster.files<span style="color: #20b2aa;">)[</span><span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>raster.files, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>a<span style="color: #20b2aa;">)</span> x <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> a<span style="color: #20b2aa;">)]]</span>
    <span style="color: #ff6347;">NAvalue</span><span style="color: #20b2aa;">(</span>r<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">0</span>
    <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>r<span style="color: #20b2aa;">)</span>
  <span style="color: #20b2aa;">})</span> 

  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>metadata<span style="color: #ff00ff;">=</span>met,
    band<span style="color: #ff00ff;">=</span>bands<span style="color: #20b2aa;">)</span> 
  <span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> ToAtSatelliteBrightnessTemperature.R</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">ToAtSatelliteBrightnessTemperature</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, band<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>

  bandnames <span style="color: #ff00ff;">&lt;-</span><span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>aerosol, blue, green, red,
  nir, swir<span style="color: #daa520;">1</span>, swir<span style="color: #daa520;">2</span>,
  panchromatic,
  cirrus,
  tirs<span style="color: #daa520;">1</span>, tirs<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>

  allowedbands <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>tirs<span style="color: #daa520;">1</span>, tirs<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>

  <span style="color: #00ffff;">if</span> <span style="color: #20b2aa;">(</span>!band <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> allowedbands<span style="color: #20b2aa;">)</span>
  <span style="color: #20b2aa;">{</span>
       <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>band, band not allowed<span style="color: #20b2aa;">))</span>
  <span style="color: #20b2aa;">}</span>

  toarad <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToTOARadiance</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, band<span style="color: #20b2aa;">)</span>

  idx <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">seq_along</span><span style="color: #20b2aa;">(</span>bandnames<span style="color: #20b2aa;">)[</span><span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>bandnames, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> band <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> x<span style="color: #20b2aa;">)]</span>
  k<span style="color: #daa520;">1</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">as.numeric</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>$metadata<span style="color: #20b2aa;">[[</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>k<span style="color: #daa520;">1</span>_constant_band_,idx<span style="color: #20b2aa;">)]])</span>
  k<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">as.numeric</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>$metadata<span style="color: #20b2aa;">[[</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>k<span style="color: #daa520;">2</span>_constant_band_,idx<span style="color: #20b2aa;">)]])</span>
  bt <span style="color: #ff00ff;">&lt;-</span> k<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">/</span> <span style="color: #ff6347;">log</span><span style="color: #20b2aa;">(</span>k<span style="color: #daa520;">1</span> <span style="color: #ff00ff;">/</span> toarad <span style="color: #ff00ff;">+</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> 
  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>bt<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
