Org/rLandsat8_(2014-04-22_by_Terradue).org
* ToLSWI.R
#+BEGIN_SRC R 
ToLSWI <- function(landsat8, is.suncorrected = FALSE) {
  
  nir <- ToTOAReflectance(landsat8, nir, is.suncorrected)
  swir1 <- ToTOAReflectance(landsat8, swir1, is.suncorrected)
  
  lswi <- (nir - swir1) / (nir + swir1)  
  
  return(lswi)
}
#+END_SRC
* ToMNDWI.R
#+BEGIN_SRC R 
ToMNDWI <- function(landsat8, is.suncorrected = FALSE) {
  
  green <- ToTOAReflectance(landsat8, green, is.suncorrected)
  swir1 <- ToTOAReflectance(landsat8, swir1, is.suncorrected)
  
  mndwi <- (green - swir1) / (green + swir1)
  
  return(mndwi)
}
#+END_SRC
* ToNBR.R
#+BEGIN_SRC R 
ToNBR <- function(landsat8, is.suncorrected = FALSE) {
  
  nir <- ToTOAReflectance(landsat8, nir, is.suncorrected)
  swir2 <- ToTOAReflectance(landsat8, swir2, is.suncorrected)
  
  nbr <- (nir - swir2) / (nir + swir2)
  
  return(nbr)
}
#+END_SRC
* ToNBRClass.R
#+BEGIN_SRC R 
ToNBRClass <- function(prefire, postfire, is.suncorrected = FALSE) {
  
  m <- c(-Inf, -500, -1, -500, -251, 1, -251, -101, 2, -101, 99, 3, 99, 269, 
    4, 269, 439, 5, 439, 659, 6, 659, 1300, 7, 1300, +Inf, -1)
  class.mat <- matrix(m, ncol=3, byrow=TRUE)
  reclass <- reclassify(10^3 * dNBR(prefire, postfire, is.suncorrected), class.mat)
  
  reclass <- ratify(reclass)
  rat <- levels(reclass)[[1]]
  rat$legend  <- c(NA, Enhanced Regrowth, High, Enhanced Regrowth, Low, Unburned, Low Severity, Moderate-low Severity, Moderate-high Severity, High Severity)
  levels(reclass) <- rat
  
  return(reclass)
}
#+END_SRC
* ToNDVI.R
#+BEGIN_SRC R 
ToNDVI <- function(landsat8, is.suncorrected = FALSE) {
  
  nir <- ToTOAReflectance(landsat8, nir, is.suncorrected)
  red <- ToTOAReflectance(landsat8, red, is.suncorrected)
  
  ndvi <- (nir - red) / (nir + red)
  
  return(ndvi)
}
#+END_SRC
