html/rLandsat8_(2014-04-22_by_Terradue).html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> ToLSWI.R</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">ToLSWI</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, is.suncorrected <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>

  nir <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToTOAReflectance</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, nir, is.suncorrected<span style="color: #20b2aa;">)</span>
  swir<span style="color: #daa520;">1</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToTOAReflectance</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, swir<span style="color: #daa520;">1</span>, is.suncorrected<span style="color: #20b2aa;">)</span>

  lswi <span style="color: #ff00ff;">&lt;-</span> <span style="color: #20b2aa;">(</span>nir <span style="color: #ff00ff;">-</span> swir<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span>nir <span style="color: #ff00ff;">+</span> swir<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>  

  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>lswi<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> ToMNDWI.R</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">ToMNDWI</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, is.suncorrected <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>

  green <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToTOAReflectance</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, green, is.suncorrected<span style="color: #20b2aa;">)</span>
  swir<span style="color: #daa520;">1</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToTOAReflectance</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, swir<span style="color: #daa520;">1</span>, is.suncorrected<span style="color: #20b2aa;">)</span>

  mndwi <span style="color: #ff00ff;">&lt;-</span> <span style="color: #20b2aa;">(</span>green <span style="color: #ff00ff;">-</span> swir<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span>green <span style="color: #ff00ff;">+</span> swir<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>

  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>mndwi<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> ToNBR.R</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">ToNBR</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, is.suncorrected <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>

  nir <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToTOAReflectance</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, nir, is.suncorrected<span style="color: #20b2aa;">)</span>
  swir<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToTOAReflectance</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, swir<span style="color: #daa520;">2</span>, is.suncorrected<span style="color: #20b2aa;">)</span>

  nbr <span style="color: #ff00ff;">&lt;-</span> <span style="color: #20b2aa;">(</span>nir <span style="color: #ff00ff;">-</span> swir<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span>nir <span style="color: #ff00ff;">+</span> swir<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>

  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>nbr<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> ToNBRClass.R</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">ToNBRClass</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>prefire, postfire, is.suncorrected <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>

  m <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff00ff;">-</span><span style="color: #daa520;">Inf</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">500</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">1</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">500</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">251</span>, <span style="color: #daa520;">1</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">251</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">101</span>, <span style="color: #daa520;">2</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">101</span>, <span style="color: #daa520;">99</span>, <span style="color: #daa520;">3</span>, <span style="color: #daa520;">99</span>, <span style="color: #daa520;">269</span>, 
    <span style="color: #daa520;">4</span>, <span style="color: #daa520;">269</span>, <span style="color: #daa520;">439</span>, <span style="color: #daa520;">5</span>, <span style="color: #daa520;">439</span>, <span style="color: #daa520;">659</span>, <span style="color: #daa520;">6</span>, <span style="color: #daa520;">659</span>, <span style="color: #daa520;">1300</span>, <span style="color: #daa520;">7</span>, <span style="color: #daa520;">1300</span>, <span style="color: #ff00ff;">+</span><span style="color: #daa520;">Inf</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
  class.mat <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">matrix</span><span style="color: #20b2aa;">(</span>m, ncol<span style="color: #ff00ff;">=</span><span style="color: #daa520;">3</span>, byrow<span style="color: #ff00ff;">=</span><span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span>
  reclass <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">reclassify</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">10</span>^<span style="color: #daa520;">3</span> * <span style="color: #ff6347;">dNBR</span><span style="color: #20b2aa;">(</span>prefire, postfire, is.suncorrected<span style="color: #20b2aa;">)</span>, class.mat<span style="color: #20b2aa;">)</span>

  reclass <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ratify</span><span style="color: #20b2aa;">(</span>reclass<span style="color: #20b2aa;">)</span>
  rat <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">levels</span><span style="color: #20b2aa;">(</span>reclass<span style="color: #20b2aa;">)[[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]</span>
  rat$legend  <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">NA</span>, Enhanced Regrowth, High, Enhanced Regrowth, Low, Unburned, Low Severity, Moderate<span style="color: #ff00ff;">-</span>low Severity, Moderate<span style="color: #ff00ff;">-</span>high Severity, High Severity<span style="color: #20b2aa;">)</span>
  <span style="color: #ff6347;">levels</span><span style="color: #20b2aa;">(</span>reclass<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> rat

  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>reclass<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> ToNDVI.R</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">ToNDVI</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, is.suncorrected <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>

  nir <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToTOAReflectance</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, nir, is.suncorrected<span style="color: #20b2aa;">)</span>
  red <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">ToTOAReflectance</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, red, is.suncorrected<span style="color: #20b2aa;">)</span>

  ndvi <span style="color: #ff00ff;">&lt;-</span> <span style="color: #20b2aa;">(</span>nir <span style="color: #ff00ff;">-</span> red<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span>nir <span style="color: #ff00ff;">+</span> red<span style="color: #20b2aa;">)</span>

  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>ndvi<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
