Org/rLandsat8_(2014-04-22_by_Terradue).org
* ToTOARadiance.R
#+BEGIN_SRC R 
ToTOARadiance <- function(landsat8, band) {
  bandnames <-c(aerosol, blue, green, red,
  nir, swir1, swir2,
  panchromatic,
  cirrus,
  tirs1, tirs2)
  
  allowedbands <- bandnames
  
  if (!band %in% allowedbands)
  {
       stop(paste(band, band not allowed))
  }
  
  idx <- seq_along(bandnames)[sapply(bandnames, function(x) band %in% x)]
  ml <- as.numeric(landsat8$metadata[[paste0(radiance_mult_band_,idx)]])
  al <- as.numeric(landsat8$metadata[[paste0(radiance_add_band_,idx)]])
  
  TOArad <- landsat8$band[[band]] * ml + al
  
  return(TOArad)
  
}
#+END_SRC
* ToTOAReflectance.R
#+BEGIN_SRC R 
ToTOAReflectance <- function(landsat8, band, is.suncorrected = FALSE) {
  bandnames <-c(aerosol, blue, green, red,
  nir, swir1, swir2,
  panchromatic,
  cirrus,
  tirs1, tirs2)
  
  allowedbands <- c(aerosol, blue, green, red,
  nir, swir1, swir2,
  panchromatic,
  cirrus)
  
  if (!band %in% allowedbands)
  {
       stop(paste(band, band not allowed))
  }
  
  idx <- seq_along(bandnames)[sapply(bandnames, function(x) band %in% x)]
  ml <- as.numeric(landsat8$metadata[[paste0(reflectance_mult_band_,idx)]])
  al <- as.numeric(landsat8$metadata[[paste0(reflectance_add_band_,idx)]])
  
  
  sun.correction.factor <- 1
  if(is.suncorrected)
       sun.correction.factor <- sin(as.numeric(landsat8$metadata$sun_elevation) * pi /180)
  TOAref <- (landsat8$band[[band]] * ml + al)/sun.correction.factor
  
  return(TOAref)
  
}
#+END_SRC
