html/rLandsat8_(2014-04-22_by_Terradue).html
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> ToTOARadiance.R</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">ToTOARadiance</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, band<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
  bandnames <span style="color: #ff00ff;">&lt;-</span><span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>aerosol, blue, green, red,
  nir, swir<span style="color: #daa520;">1</span>, swir<span style="color: #daa520;">2</span>,
  panchromatic,
  cirrus,
  tirs<span style="color: #daa520;">1</span>, tirs<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>

  allowedbands <span style="color: #ff00ff;">&lt;-</span> bandnames

  <span style="color: #00ffff;">if</span> <span style="color: #20b2aa;">(</span>!band <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> allowedbands<span style="color: #20b2aa;">)</span>
  <span style="color: #20b2aa;">{</span>
       <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>band, band not allowed<span style="color: #20b2aa;">))</span>
  <span style="color: #20b2aa;">}</span>

  idx <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">seq_along</span><span style="color: #20b2aa;">(</span>bandnames<span style="color: #20b2aa;">)[</span><span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>bandnames, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> band <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> x<span style="color: #20b2aa;">)]</span>
  ml <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">as.numeric</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>$metadata<span style="color: #20b2aa;">[[</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>radiance_mult_band_,idx<span style="color: #20b2aa;">)]])</span>
  al <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">as.numeric</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>$metadata<span style="color: #20b2aa;">[[</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>radiance_add_band_,idx<span style="color: #20b2aa;">)]])</span>

  TOArad <span style="color: #ff00ff;">&lt;-</span> landsat<span style="color: #daa520;">8</span>$band<span style="color: #20b2aa;">[[</span>band<span style="color: #20b2aa;">]]</span> * ml <span style="color: #ff00ff;">+</span> al

  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>TOArad<span style="color: #20b2aa;">)</span>

<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> ToTOAReflectance.R</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">ToTOAReflectance</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>, band, is.suncorrected <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
  bandnames <span style="color: #ff00ff;">&lt;-</span><span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>aerosol, blue, green, red,
  nir, swir<span style="color: #daa520;">1</span>, swir<span style="color: #daa520;">2</span>,
  panchromatic,
  cirrus,
  tirs<span style="color: #daa520;">1</span>, tirs<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>

  allowedbands <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>aerosol, blue, green, red,
  nir, swir<span style="color: #daa520;">1</span>, swir<span style="color: #daa520;">2</span>,
  panchromatic,
  cirrus<span style="color: #20b2aa;">)</span>

  <span style="color: #00ffff;">if</span> <span style="color: #20b2aa;">(</span>!band <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> allowedbands<span style="color: #20b2aa;">)</span>
  <span style="color: #20b2aa;">{</span>
       <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>band, band not allowed<span style="color: #20b2aa;">))</span>
  <span style="color: #20b2aa;">}</span>

  idx <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">seq_along</span><span style="color: #20b2aa;">(</span>bandnames<span style="color: #20b2aa;">)[</span><span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>bandnames, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> band <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> x<span style="color: #20b2aa;">)]</span>
  ml <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">as.numeric</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>$metadata<span style="color: #20b2aa;">[[</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>reflectance_mult_band_,idx<span style="color: #20b2aa;">)]])</span>
  al <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">as.numeric</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>$metadata<span style="color: #20b2aa;">[[</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>reflectance_add_band_,idx<span style="color: #20b2aa;">)]])</span>


  sun.correction.factor <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span>
  <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>is.suncorrected<span style="color: #20b2aa;">)</span>
       sun.correction.factor <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">sin</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">as.numeric</span><span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>$metadata$sun_elevation<span style="color: #20b2aa;">)</span> * pi <span style="color: #ff00ff;">/</span><span style="color: #daa520;">180</span><span style="color: #20b2aa;">)</span>
  TOAref <span style="color: #ff00ff;">&lt;-</span> <span style="color: #20b2aa;">(</span>landsat<span style="color: #daa520;">8</span>$band<span style="color: #20b2aa;">[[</span>band<span style="color: #20b2aa;">]]</span> * ml <span style="color: #ff00ff;">+</span> al<span style="color: #20b2aa;">)</span><span style="color: #ff00ff;">/</span>sun.correction.factor

  <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>TOAref<span style="color: #20b2aa;">)</span>

<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: tian</p>
<p class="date">Created: 2014-09-15 Mon 21:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
